ToRoom Property (Phase)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Room this[
	Phase phase
] { get; }
Visual Basic
Public ReadOnly Property ToRoom ( _
	phase As Phase _
) As Room
	Get
Visual C++
public:
property Room^ ToRoom[Phase^ phase] {
	Room^ get (Phase^ phase);
}
Parameters
phase
Type: Autodesk.Revit.DBPhase
See Also
FamilyInstance Class
ToRoom Overload
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →